Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTG/include/pio/pic32cx1025mtg128.h
#define MUX_PC6A_FLEXCOM5_IO3                      _UINT32_(0)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO3 */
#define PIO_PC6A_FLEXCOM5_IO3                      (_UINT32_(1) << 6) /**< FLEXCOM5 signal: FLEXCOM5_IO3 */
#define PIN_PA22C_FLEXCOM5_IO4                     _UINT32_(22) /**< FLEXCOM5 signal: FLEXCOM5_IO4 on PA22 mux C */
#define MUX_PA22C_FLEXCOM5_IO4                     _UINT32_(2)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO4 */
#define PIO_PA22C_FLEXCOM5_IO4                     (_UINT32_(1) << 22) /**< FLEXCOM5 signal: FLEXCOM5_IO4 */
#define PIN_PB15B_FLEXCOM5_IO4                     _UINT32_(47) /**< FLEXCOM5 signal: FLEXCOM5_IO4 on PB15 mux B */
#define MUX_PB15B_FLEXCOM5_IO4                     _UINT32_(1)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO4 */
#define PIO_PB15B_FLEXCOM5_IO4                     (_UINT32_(1) << 15) /**< FLEXCOM5 signal: FLEXCOM5_IO4 */
#define PIN_PB22C_FLEXCOM5_IO4                     _UINT32_(54) /**< FLEXCOM5 signal: FLEXCOM5_IO4 on PB22 mux C */
#define MUX_PB22C_FLEXCOM5_IO4                     _UINT32_(2)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO4 */
#define PIO_PB22C_FLEXCOM5_IO4                     (_UINT32_(1) << 22) /**< FLEXCOM5 signal: FLEXCOM5_IO4 */
#define PIN_PC7C_FLEXCOM5_IO4                      _UINT32_(71) /**< FLEXCOM5 signal: FLEXCOM5_IO4 on PC7 mux C */
#define MUX_PC7C_FLEXCOM5_IO4                      _UINT32_(2)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO4 */
#define PIO_PC7C_FLEXCOM5_IO4                      (_UINT32_(1) << 7) /**< FLEXCOM5 signal: FLEXCOM5_IO4 */
/* ========== PIO definition for FLEXCOM6 peripheral ========== */
#define PIN_PA0A_FLEXCOM6_IO0                      _UINT32_(0)  /**< FLEXCOM6 signal: FLEXCOM6_IO0 on PA0 mux A */
#define MUX_PA0A_FLEXCOM6_IO0                      _UINT32_(0)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO0 */
#define PIO_PA0A_FLEXCOM6_IO0                      (_UINT32_(1) << 0) /**< FLEXCOM6 signal: FLEXCOM6_IO0 */
#define PIN_PA25B_FLEXCOM6_IO0                     _UINT32_(25) /**< FLEXCOM6 signal: FLEXCOM6_IO0 on PA25 mux B */
#define MUX_PA25B_FLEXCOM6_IO0                     _UINT32_(1)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO0 */
#define PIO_PA25B_FLEXCOM6_IO0                     (_UINT32_(1) << 25) /**< FLEXCOM6 signal: FLEXCOM6_IO0 */
#define PIN_PC6B_FLEXCOM6_IO0                      _UINT32_(70) /**< FLEXCOM6 signal: FLEXCOM6_IO0 on PC6 mux B */
#define MUX_PC6B_FLEXCOM6_IO0                      _UINT32_(1)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO0 */
#define PIO_PC6B_FLEXCOM6_IO0                      (_UINT32_(1) << 6) /**< FLEXCOM6 signal: FLEXCOM6_IO0 */
#define PIN_PC16A_FLEXCOM6_IO0                     _UINT32_(80) /**< FLEXCOM6 signal: FLEXCOM6_IO0 on PC16 mux A */
#define MUX_PC16A_FLEXCOM6_IO0                     _UINT32_(0)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO0 */
#define PIO_PC16A_FLEXCOM6_IO0                     (_UINT32_(1) << 16) /**< FLEXCOM6 signal: FLEXCOM6_IO0 */
#define PIN_PA1A_FLEXCOM6_IO1                      _UINT32_(1)  /**< FLEXCOM6 signal: FLEXCOM6_IO1 on PA1 mux A */
#define MUX_PA1A_FLEXCOM6_IO1                      _UINT32_(0)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO1 */
#define PIO_PA1A_FLEXCOM6_IO1                      (_UINT32_(1) << 1) /**< FLEXCOM6 signal: FLEXCOM6_IO1 */
#define PIN_PA26B_FLEXCOM6_IO1                     _UINT32_(26) /**< FLEXCOM6 signal: FLEXCOM6_IO1 on PA26 mux B */
#define MUX_PA26B_FLEXCOM6_IO1                     _UINT32_(1)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO1 */
#define PIO_PA26B_FLEXCOM6_IO1                     (_UINT32_(1) << 26) /**< FLEXCOM6 signal: FLEXCOM6_IO1 */
#define PIN_PC7B_FLEXCOM6_IO1                      _UINT32_(71) /**< FLEXCOM6 signal: FLEXCOM6_IO1 on PC7 mux B */
#define MUX_PC7B_FLEXCOM6_IO1                      _UINT32_(1)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO1 */
#define PIO_PC7B_FLEXCOM6_IO1                      (_UINT32_(1) << 7) /**< FLEXCOM6 signal: FLEXCOM6_IO1 */
#define PIN_PC17A_FLEXCOM6_IO1                     _UINT32_(81) /**< FLEXCOM6 signal: FLEXCOM6_IO1 on PC17 mux A */
#define MUX_PC17A_FLEXCOM6_IO1                     _UINT32_(0)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO1 */
#define PIO_PC17A_FLEXCOM6_IO1                     (_UINT32_(1) << 17) /**< FLEXCOM6 signal: FLEXCOM6_IO1 */
#define PIN_PA27B_FLEXCOM6_IO2                     _UINT32_(27) /**< FLEXCOM6 signal: FLEXCOM6_IO2 on PA27 mux B */
#define MUX_PA27B_FLEXCOM6_IO2                     _UINT32_(1)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO2 */
#define PIO_PA27B_FLEXCOM6_IO2                     (_UINT32_(1) << 27) /**< FLEXCOM6 signal: FLEXCOM6_IO2 */
#define PIN_PC18A_FLEXCOM6_IO2                     _UINT32_(82) /**< FLEXCOM6 signal: FLEXCOM6_IO2 on PC18 mux A */
#define MUX_PC18A_FLEXCOM6_IO2                     _UINT32_(0)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO2 */
#define PIO_PC18A_FLEXCOM6_IO2                     (_UINT32_(1) << 18) /**< FLEXCOM6 signal: FLEXCOM6_IO2 */
#define PIN_PA28B_FLEXCOM6_IO3                     _UINT32_(28) /**< FLEXCOM6 signal: FLEXCOM6_IO3 on PA28 mux B */
#define MUX_PA28B_FLEXCOM6_IO3                     _UINT32_(1)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO3 */
#define PIO_PA28B_FLEXCOM6_IO3                     (_UINT32_(1) << 28) /**< FLEXCOM6 signal: FLEXCOM6_IO3 */
#define PIN_PC19A_FLEXCOM6_IO3                     _UINT32_(83) /**< FLEXCOM6 signal: FLEXCOM6_IO3 on PC19 mux A */
#define MUX_PC19A_FLEXCOM6_IO3                     _UINT32_(0)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO3 */
#define PIO_PC19A_FLEXCOM6_IO3                     (_UINT32_(1) << 19) /**< FLEXCOM6 signal: FLEXCOM6_IO3 */
#define PIN_PA27C_FLEXCOM6_IO4                     _UINT32_(27) /**< FLEXCOM6 signal: FLEXCOM6_IO4 on PA27 mux C */
#define MUX_PA27C_FLEXCOM6_IO4                     _UINT32_(2)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO4 */
#define PIO_PA27C_FLEXCOM6_IO4                     (_UINT32_(1) << 27) /**< FLEXCOM6 signal: FLEXCOM6_IO4 */
#define PIN_PB16B_FLEXCOM6_IO4                     _UINT32_(48) /**< FLEXCOM6 signal: FLEXCOM6_IO4 on PB16 mux B */
#define MUX_PB16B_FLEXCOM6_IO4                     _UINT32_(1)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO4 */
#define PIO_PB16B_FLEXCOM6_IO4                     (_UINT32_(1) << 16) /**< FLEXCOM6 signal: FLEXCOM6_IO4 */
#define PIN_PC18B_FLEXCOM6_IO4                     _UINT32_(82) /**< FLEXCOM6 signal: FLEXCOM6_IO4 on PC18 mux B */
#define MUX_PC18B_FLEXCOM6_IO4                     _UINT32_(1)  /**< FLEXCOM6 signal line function value: FLEXCOM6_IO4 */
#define PIO_PC18B_FLEXCOM6_IO4                     (_UINT32_(1) << 18) /**< FLEXCOM6 signal: FLEXCOM6_IO4 */
/* ========== PIO definition for FLEXCOM7 peripheral ========== */
#define PIN_PB4B_FLEXCOM7_IO0                      _UINT32_(36) /**< FLEXCOM7 signal: FLEXCOM7_IO0 on PB4 mux B */
#define MUX_PB4B_FLEXCOM7_IO0                      _UINT32_(1)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO0 */
#define PIO_PB4B_FLEXCOM7_IO0                      (_UINT32_(1) << 4) /**< FLEXCOM7 signal: FLEXCOM7_IO0 */
#define PIN_PC13B_FLEXCOM7_IO0                     _UINT32_(77) /**< FLEXCOM7 signal: FLEXCOM7_IO0 on PC13 mux B */
#define MUX_PC13B_FLEXCOM7_IO0                     _UINT32_(1)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO0 */
#define PIO_PC13B_FLEXCOM7_IO0                     (_UINT32_(1) << 13) /**< FLEXCOM7 signal: FLEXCOM7_IO0 */
#define PIN_PC21A_FLEXCOM7_IO0                     _UINT32_(85) /**< FLEXCOM7 signal: FLEXCOM7_IO0 on PC21 mux A */
#define MUX_PC21A_FLEXCOM7_IO0                     _UINT32_(0)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO0 */
#define PIO_PC21A_FLEXCOM7_IO0                     (_UINT32_(1) << 21) /**< FLEXCOM7 signal: FLEXCOM7_IO0 */
#define PIN_PB3B_FLEXCOM7_IO1                      _UINT32_(35) /**< FLEXCOM7 signal: FLEXCOM7_IO1 on PB3 mux B */
#define MUX_PB3B_FLEXCOM7_IO1                      _UINT32_(1)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO1 */
#define PIO_PB3B_FLEXCOM7_IO1                      (_UINT32_(1) << 3) /**< FLEXCOM7 signal: FLEXCOM7_IO1 */
#define PIN_PC12B_FLEXCOM7_IO1                     _UINT32_(76) /**< FLEXCOM7 signal: FLEXCOM7_IO1 on PC12 mux B */
#define MUX_PC12B_FLEXCOM7_IO1                     _UINT32_(1)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO1 */
#define PIO_PC12B_FLEXCOM7_IO1                     (_UINT32_(1) << 12) /**< FLEXCOM7 signal: FLEXCOM7_IO1 */
#define PIN_PC20A_FLEXCOM7_IO1                     _UINT32_(84) /**< FLEXCOM7 signal: FLEXCOM7_IO1 on PC20 mux A */
#define MUX_PC20A_FLEXCOM7_IO1                     _UINT32_(0)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO1 */
#define PIO_PC20A_FLEXCOM7_IO1                     (_UINT32_(1) << 20) /**< FLEXCOM7 signal: FLEXCOM7_IO1 */
#define PIN_PB2B_FLEXCOM7_IO2                      _UINT32_(34) /**< FLEXCOM7 signal: FLEXCOM7_IO2 on PB2 mux B */
#define MUX_PB2B_FLEXCOM7_IO2                      _UINT32_(1)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO2 */
#define PIO_PB2B_FLEXCOM7_IO2                      (_UINT32_(1) << 2) /**< FLEXCOM7 signal: FLEXCOM7_IO2 */
#define PIN_PC15B_FLEXCOM7_IO2                     _UINT32_(79) /**< FLEXCOM7 signal: FLEXCOM7_IO2 on PC15 mux B */
#define MUX_PC15B_FLEXCOM7_IO2                     _UINT32_(1)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO2 */
#define PIO_PC15B_FLEXCOM7_IO2                     (_UINT32_(1) << 15) /**< FLEXCOM7 signal: FLEXCOM7_IO2 */
#define PIN_PB1B_FLEXCOM7_IO3                      _UINT32_(33) /**< FLEXCOM7 signal: FLEXCOM7_IO3 on PB1 mux B */
#define MUX_PB1B_FLEXCOM7_IO3                      _UINT32_(1)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO3 */
#define PIO_PB1B_FLEXCOM7_IO3                      (_UINT32_(1) << 1) /**< FLEXCOM7 signal: FLEXCOM7_IO3 */
#define PIN_PC14B_FLEXCOM7_IO3                     _UINT32_(78) /**< FLEXCOM7 signal: FLEXCOM7_IO3 on PC14 mux B */
#define MUX_PC14B_FLEXCOM7_IO3                     _UINT32_(1)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO3 */
#define PIO_PC14B_FLEXCOM7_IO3                     (_UINT32_(1) << 14) /**< FLEXCOM7 signal: FLEXCOM7_IO3 */
#define PIN_PB2C_FLEXCOM7_IO4                      _UINT32_(34) /**< FLEXCOM7 signal: FLEXCOM7_IO4 on PB2 mux C */
#define MUX_PB2C_FLEXCOM7_IO4                      _UINT32_(2)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO4 */
#define PIO_PB2C_FLEXCOM7_IO4                      (_UINT32_(1) << 2) /**< FLEXCOM7 signal: FLEXCOM7_IO4 */
#define PIN_PC11B_FLEXCOM7_IO4                     _UINT32_(75) /**< FLEXCOM7 signal: FLEXCOM7_IO4 on PC11 mux B */
#define MUX_PC11B_FLEXCOM7_IO4                     _UINT32_(1)  /**< FLEXCOM7 signal line function value: FLEXCOM7_IO4 */
#define PIO_PC11B_FLEXCOM7_IO4                     (_UINT32_(1) << 11) /**< FLEXCOM7 signal: FLEXCOM7_IO4 */
/* ========== PIO definition for MCSPI peripheral ========== */
#define PIN_PD6A_MCSPI_MISO                        _UINT32_(102) /**< MCSPI signal: MCSPI_MISO on PD6 mux A */
#define MUX_PD6A_MCSPI_MISO                        _UINT32_(0)  /**< MCSPI signal line function value: MCSPI_MISO */
#define PIO_PD6A_MCSPI_MISO                        (_UINT32_(1) << 6) /**< MCSPI signal: MCSPI_MISO */
#define PIN_PD7A_MCSPI_MOSI0                       _UINT32_(103) /**< MCSPI signal: MCSPI_MOSI0 on PD7 mux A */
#define MUX_PD7A_MCSPI_MOSI0                       _UINT32_(0)  /**< MCSPI signal line function value: MCSPI_MOSI0 */
#define PIO_PD7A_MCSPI_MOSI0                       (_UINT32_(1) << 7) /**< MCSPI signal: MCSPI_MOSI0 */
#define PIN_PD8B_MCSPI_MOSI1                       _UINT32_(104) /**< MCSPI signal: MCSPI_MOSI1 on PD8 mux B */
#define MUX_PD8B_MCSPI_MOSI1                       _UINT32_(1)  /**< MCSPI signal line function value: MCSPI_MOSI1 */
#define PIO_PD8B_MCSPI_MOSI1                       (_UINT32_(1) << 8) /**< MCSPI signal: MCSPI_MOSI1 */
#define PIN_PD9B_MCSPI_MOSI2                       _UINT32_(105) /**< MCSPI signal: MCSPI_MOSI2 on PD9 mux B */
#define MUX_PD9B_MCSPI_MOSI2                       _UINT32_(1)  /**< MCSPI signal line function value: MCSPI_MOSI2 */
#define PIO_PD9B_MCSPI_MOSI2                       (_UINT32_(1) << 9) /**< MCSPI signal: MCSPI_MOSI2 */
#define PIN_PD10B_MCSPI_MOSI3                      _UINT32_(106) /**< MCSPI signal: MCSPI_MOSI3 on PD10 mux B */
#define MUX_PD10B_MCSPI_MOSI3                      _UINT32_(1)  /**< MCSPI signal line function value: MCSPI_MOSI3 */
#define PIO_PD10B_MCSPI_MOSI3                      (_UINT32_(1) << 10) /**< MCSPI signal: MCSPI_MOSI3 */
#define PIN_PD8A_MCSPI_NPCS0                       _UINT32_(104) /**< MCSPI signal: MCSPI_NPCS0 on PD8 mux A */
#define MUX_PD8A_MCSPI_NPCS0                       _UINT32_(0)  /**< MCSPI signal line function value: MCSPI_NPCS0 */
#define PIO_PD8A_MCSPI_NPCS0                       (_UINT32_(1) << 8) /**< MCSPI signal: MCSPI_NPCS0 */
#define PIN_PD9A_MCSPI_NPCS1                       _UINT32_(105) /**< MCSPI signal: MCSPI_NPCS1 on PD9 mux A */
#define MUX_PD9A_MCSPI_NPCS1                       _UINT32_(0)  /**< MCSPI signal line function value: MCSPI_NPCS1 */
#define PIO_PD9A_MCSPI_NPCS1                       (_UINT32_(1) << 9) /**< MCSPI signal: MCSPI_NPCS1 */
#define PIN_PD10A_MCSPI_NPCS2                      _UINT32_(106) /**< MCSPI signal: MCSPI_NPCS2 on PD10 mux A */
#define MUX_PD10A_MCSPI_NPCS2                      _UINT32_(0)  /**< MCSPI signal line function value: MCSPI_NPCS2 */
#define PIO_PD10A_MCSPI_NPCS2                      (_UINT32_(1) << 10) /**< MCSPI signal: MCSPI_NPCS2 */
#define PIN_PD11A_MCSPI_NPCS3                      _UINT32_(107) /**< MCSPI signal: MCSPI_NPCS3 on PD11 mux A */
#define MUX_PD11A_MCSPI_NPCS3                      _UINT32_(0)  /**< MCSPI signal line function value: MCSPI_NPCS3 */
#define PIO_PD11A_MCSPI_NPCS3                      (_UINT32_(1) << 11) /**< MCSPI signal: MCSPI_NPCS3 */
#define PIN_PD5A_MCSPI_SPCK                        _UINT32_(101) /**< MCSPI signal: MCSPI_SPCK on PD5 mux A */
#define MUX_PD5A_MCSPI_SPCK                        _UINT32_(0)  /**< MCSPI signal line function value: MCSPI_SPCK */
#define PIO_PD5A_MCSPI_SPCK                        (_UINT32_(1) << 5) /**< MCSPI signal: MCSPI_SPCK */
/* ========== PIO definition for PMC peripheral ========== */
#define PIN_PA20A_PMC_PCK0                         _UINT32_(20) /**< PMC signal: PMC_PCK0 on PA20 mux A */
#define MUX_PA20A_PMC_PCK0                         _UINT32_(0)  /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PA20A_PMC_PCK0                         (_UINT32_(1) << 20) /**< PMC signal: PMC_PCK0 */
#define PIN_PC22A_PMC_PCK0                         _UINT32_(86) /**< PMC signal: PMC_PCK0 on PC22 mux A */
#define MUX_PC22A_PMC_PCK0                         _UINT32_(0)  /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PC22A_PMC_PCK0                         (_UINT32_(1) << 22) /**< PMC signal: PMC_PCK0 */
#define PIN_PA2A_PMC_PCK1                          _UINT32_(2)  /**< PMC signal: PMC_PCK1 on PA2 mux A */
#define MUX_PA2A_PMC_PCK1                          _UINT32_(0)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PA2A_PMC_PCK1                          (_UINT32_(1) << 2) /**< PMC signal: PMC_PCK1 */
#define PIN_PB1C_PMC_PCK1                          _UINT32_(33) /**< PMC signal: PMC_PCK1 on PB1 mux C */
#define MUX_PB1C_PMC_PCK1                          _UINT32_(2)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PB1C_PMC_PCK1                          (_UINT32_(1) << 1) /**< PMC signal: PMC_PCK1 */
#define PIN_PC5A_PMC_PCK2                          _UINT32_(69) /**< PMC signal: PMC_PCK2 on PC5 mux A */
#define MUX_PC5A_PMC_PCK2                          _UINT32_(0)  /**< PMC signal line function value: PMC_PCK2 */
#define PIO_PC5A_PMC_PCK2                          (_UINT32_(1) << 5) /**< PMC signal: PMC_PCK2 */
#define PIN_PD4B_PMC_PCK2                          _UINT32_(100) /**< PMC signal: PMC_PCK2 on PD4 mux B */
#define MUX_PD4B_PMC_PCK2                          _UINT32_(1)  /**< PMC signal line function value: PMC_PCK2 */
#define PIO_PD4B_PMC_PCK2                          (_UINT32_(1) << 4) /**< PMC signal: PMC_PCK2 */
/* ========== PIO definition for PWM peripheral ========== */
#define PIN_PD3C_PWM_PWMH0                         _UINT32_(99) /**< PWM signal: PWM_PWMH0 on PD3 mux C */
#define MUX_PD3C_PWM_PWMH0                         _UINT32_(2)  /**< PWM signal line function value: PWM_PWMH0 */
#define PIO_PD3C_PWM_PWMH0                         (_UINT32_(1) << 3) /**< PWM signal: PWM_PWMH0 */
#define PIN_PD15B_PWM_PWMH1                        _UINT32_(111) /**< PWM signal: PWM_PWMH1 on PD15 mux B */
#define MUX_PD15B_PWM_PWMH1                        _UINT32_(1)  /**< PWM signal line function value: PWM_PWMH1 */
#define PIO_PD15B_PWM_PWMH1                        (_UINT32_(1) << 15) /**< PWM signal: PWM_PWMH1 */
#define PIN_PD16B_PWM_PWMH2                        _UINT32_(112) /**< PWM signal: PWM_PWMH2 on PD16 mux B */
#define MUX_PD16B_PWM_PWMH2                        _UINT32_(1)  /**< PWM signal line function value: PWM_PWMH2 */
#define PIO_PD16B_PWM_PWMH2                        (_UINT32_(1) << 16) /**< PWM signal: PWM_PWMH2 */
#define PIN_PD17A_PWM_PWML0                        _UINT32_(113) /**< PWM signal: PWM_PWML0 on PD17 mux A */
#define MUX_PD17A_PWM_PWML0                        _UINT32_(0)  /**< PWM signal line function value: PWM_PWML0 */
#define PIO_PD17A_PWM_PWML0                        (_UINT32_(1) << 17) /**< PWM signal: PWM_PWML0 */
#define PIN_PD18A_PWM_PWML1                        _UINT32_(114) /**< PWM signal: PWM_PWML1 on PD18 mux A */
#define MUX_PD18A_PWM_PWML1                        _UINT32_(0)  /**< PWM signal line function value: PWM_PWML1 */
#define PIO_PD18A_PWM_PWML1                        (_UINT32_(1) << 18) /**< PWM signal: PWM_PWML1 */
#define PIN_PD19A_PWM_PWML2                        _UINT32_(115) /**< PWM signal: PWM_PWML2 on PD19 mux A */
#define MUX_PD19A_PWM_PWML2                        _UINT32_(0)  /**< PWM signal line function value: PWM_PWML2 */
#define PIO_PD19A_PWM_PWML2                        (_UINT32_(1) << 19) /**< PWM signal: PWM_PWML2 */
/* ========== PIO definition for QSPI peripheral ========== */
#define PIN_PC14A_QSPI_QCS                         _UINT32_(78) /**< QSPI signal: QSPI_QCS on PC14 mux A */
#define MUX_PC14A_QSPI_QCS                         _UINT32_(0)  /**< QSPI signal line function value: QSPI_QCS */
#define PIO_PC14A_QSPI_QCS                         (_UINT32_(1) << 14) /**< QSPI signal: QSPI_QCS */
#define PIN_PC13A_QSPI_QIO0                        _UINT32_(77) /**< QSPI signal: QSPI_QIO0 on PC13 mux A */
#define MUX_PC13A_QSPI_QIO0                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QIO0 */
#define PIO_PC13A_QSPI_QIO0                        (_UINT32_(1) << 13) /**< QSPI signal: QSPI_QIO0 */
#define PIN_PC12A_QSPI_QIO1                        _UINT32_(76) /**< QSPI signal: QSPI_QIO1 on PC12 mux A */
#define MUX_PC12A_QSPI_QIO1                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QIO1 */
#define PIO_PC12A_QSPI_QIO1                        (_UINT32_(1) << 12) /**< QSPI signal: QSPI_QIO1 */
#define PIN_PC11A_QSPI_QIO2                        _UINT32_(75) /**< QSPI signal: QSPI_QIO2 on PC11 mux A */
#define MUX_PC11A_QSPI_QIO2                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QIO2 */
#define PIO_PC11A_QSPI_QIO2                        (_UINT32_(1) << 11) /**< QSPI signal: QSPI_QIO2 */
#define PIN_PC10A_QSPI_QIO3                        _UINT32_(74) /**< QSPI signal: QSPI_QIO3 on PC10 mux A */
#define MUX_PC10A_QSPI_QIO3                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QIO3 */
#define PIO_PC10A_QSPI_QIO3                        (_UINT32_(1) << 10) /**< QSPI signal: QSPI_QIO3 */
#define PIN_PC15A_QSPI_QSCK                        _UINT32_(79) /**< QSPI signal: QSPI_QSCK on PC15 mux A */
#define MUX_PC15A_QSPI_QSCK                        _UINT32_(0)  /**< QSPI signal line function value: QSPI_QSCK */
#define PIO_PC15A_QSPI_QSCK                        (_UINT32_(1) << 15) /**< QSPI signal: QSPI_QSCK */
/* ========== PIO definition for SLCDC peripheral ========== */
#define PIN_PA21A_SLCDC_COM0                       _UINT32_(21) /**< SLCDC signal: SLCDC_COM0 on PA21 mux A */
#define MUX_PA21A_SLCDC_COM0                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_COM0 */
#define PIO_PA21A_SLCDC_COM0                       (_UINT32_(1) << 21) /**< SLCDC signal: SLCDC_COM0 */
#define PIN_PA22A_SLCDC_COM1                       _UINT32_(22) /**< SLCDC signal: SLCDC_COM1 on PA22 mux A */
#define MUX_PA22A_SLCDC_COM1                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_COM1 */
#define PIO_PA22A_SLCDC_COM1                       (_UINT32_(1) << 22) /**< SLCDC signal: SLCDC_COM1 */
#define PIN_PA23A_SLCDC_COM2                       _UINT32_(23) /**< SLCDC signal: SLCDC_COM2 on PA23 mux A */
#define MUX_PA23A_SLCDC_COM2                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_COM2 */
#define PIO_PA23A_SLCDC_COM2                       (_UINT32_(1) << 23) /**< SLCDC signal: SLCDC_COM2 */
#define PIN_PA24A_SLCDC_COM3                       _UINT32_(24) /**< SLCDC signal: SLCDC_COM3 on PA24 mux A */
#define MUX_PA24A_SLCDC_COM3                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_COM3 */
#define PIO_PA24A_SLCDC_COM3                       (_UINT32_(1) << 24) /**< SLCDC signal: SLCDC_COM3 */
#define PIN_PA25A_SLCDC_COM4                       _UINT32_(25) /**< SLCDC signal: SLCDC_COM4 on PA25 mux A */
#define MUX_PA25A_SLCDC_COM4                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_COM4 */
#define PIO_PA25A_SLCDC_COM4                       (_UINT32_(1) << 25) /**< SLCDC signal: SLCDC_COM4 */
#define PIN_PA26A_SLCDC_COM5                       _UINT32_(26) /**< SLCDC signal: SLCDC_COM5 on PA26 mux A */
#define MUX_PA26A_SLCDC_COM5                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_COM5 */
#define PIO_PA26A_SLCDC_COM5                       (_UINT32_(1) << 26) /**< SLCDC signal: SLCDC_COM5 */
#define PIN_PA27A_SLCDC_COM6                       _UINT32_(27) /**< SLCDC signal: SLCDC_COM6 on PA27 mux A */
#define MUX_PA27A_SLCDC_COM6                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_COM6 */
#define PIO_PA27A_SLCDC_COM6                       (_UINT32_(1) << 27) /**< SLCDC signal: SLCDC_COM6 */
#define PIN_PA28A_SLCDC_COM7                       _UINT32_(28) /**< SLCDC signal: SLCDC_COM7 on PA28 mux A */
#define MUX_PA28A_SLCDC_COM7                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_COM7 */
#define PIO_PA28A_SLCDC_COM7                       (_UINT32_(1) << 28) /**< SLCDC signal: SLCDC_COM7 */
#define PIN_PA29A_SLCDC_SEG0                       _UINT32_(29) /**< SLCDC signal: SLCDC_SEG0 on PA29 mux A */
#define MUX_PA29A_SLCDC_SEG0                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG0 */
#define PIO_PA29A_SLCDC_SEG0                       (_UINT32_(1) << 29) /**< SLCDC signal: SLCDC_SEG0 */
#define PIN_PA30A_SLCDC_SEG1                       _UINT32_(30) /**< SLCDC signal: SLCDC_SEG1 on PA30 mux A */
#define MUX_PA30A_SLCDC_SEG1                       _UINT32_(0)  /**< SLCDC signal line function value: SLCDC_SEG1 */
#define PIO_PA30A_SLCDC_SEG1                       (_UINT32_(1) << 30) /**< SLCDC signal: SLCDC_SEG1 */
#define PIN_PA31A_SLCDC_SEG2                       _UINT32_(31) /**< SLCDC signal: SLCDC_SEG2 on PA31 mux A */
